ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV116/ESP32_WordClockV116.ino
/* 
 Author      : Ed Nieuwenhuys ednieuw.nl
 Changes V001: Derived from ESP32C3S3_WordClockV026.ino
 Changes V003: Clock and SK6812 LEDstrip working
...
 Changes V094: Replaced NIMBLE with ESP32 BLE
 Changes V095: Cleanup code. New function LEDstartup. Webserver to core 1. Loop is again 210,000L/s -> xTaskCreatePinnedToCore(WebServerTask,"WebServerTask", 4096, NULL, 1, NULL, 1 ); 
 Changes V096: Removed ESP32 BLE. Caused restarts in ESP32 3.2.0. NimBLE works fine and probably better.
 Changes V097: Webpage remembers and also shows last small or long menu display
 Changes V098: Cleanup code in ReworkInputString(). Changed if(Mem.WIFIcredentials == SET_AND_OK)  WiFi.reconnect(); in every minute. 
               After power faillure the clock starts faster than a WIFI-router.  .bin upload repaired. Did not upload since V091
 Changes V099: EDSOFT bij 256 LED-klok. Removed: sntp_set_time_sync_notification_cb(NTPnotify); Seems unnecessary. 
 Changes V100: Disconnect for a day and try again to connect WIFI. Added NLM1M2M3M4L161 design.  Filename changed: without Arduino in it
 Changes V101: IS did not recolour per second -> repaired. HTML-Menu appears on time after upload. Added HOURLYHETISWAS with Q7.
 Changes V102: Corrected that every second the time was printed
 Changes V103: M1M2M3M4 clock did not respond to HET IS WAS colouring. Time printing every minute had no linefeed
 Changes V104: If length BLEbroadcastName < 4 fill in the name WordClock. If BLE connection inactive for 15 minutes -> disconnect. Focus back to webpage input field
 Changes V105: Menu optie Q8 is RAINBOW Option Q8 changed to '(' EdSoftLEDSOn and Q9 -> ')' HetIsWasOff in menu as new option
 Changes V106: Fast rainbow added. ~ in menu --> Hourly changing display mode added for demo purposes
 Changes V107: Print DisplayChoice() added.  case '~': Mem.RandomDisplay 1 = per minute or 2= per hour 0 is off 
 Changes V108: Added BLEbroadcastname in webpage title. Bug fix in menu U Demo mode. Runs with Arduino core 2.0.17 en Espressif core 3.3.0
 Changes V109: Option Y Rainbow test operates outside WIFI when entered via webpage
 Changes V110: Use of Mem.WIFIcredentials optimized to restore WIFI connection after power loss 
 Changes V111: Made CheckRestoreWIFIconnectivity(). Removed RAINBOWFAST
 Changes V112: Tested in several clocks
 Changes V113: In Ulrich design Klok No47 --> Shirley Janssen  NLM1M2M3M4L161
 Changes V114: is V113
 Changes V115: Time functions updated. You can compile now By Arduino pin (default)
 Changes V116: Removed redundant code

*********************
How to compile: 
Install ESP32 boards
Board: ESP32 core version >3.2.0 
Partition Scheme: With FAT
Pin Numbering: By Arduino pin (default)   
               By GPIO number (legacy).     -- > When usin NEOpixel change 
USB mode: Normal (Tiny USB)
**********************

Select below, with only one #define selected, the clock type

*/
// =============================================================================================================================
// ------------------>   Define only one clock type
//#define FOURLANGUAGECLOCK       // Four-language clock with 625 LEDs 
#define NL144CLOCK              // Dutch display for 12 x 12 Front
//#define NL92CLOCK               // Dutch display for one LED behind every character
//#define NLM1M2M3M4L161          // NL EdSoft Qclock design
//#define DE144CLOCK              // German display for 12 x 12 Front
//#define NLM1M2M3M4L94           // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L114          // NL clock with four extra LEDs for the minutes to light up
//#define NLM1M2M3M4L144          // NL clock with four extra LEDs for the minutes to light up 
//#define NLM1M2M3M4L256          // NL clock with four extra LEDs for the minutes to light up

//------------------------------------------------------------------------------              //
// ESP32 Definition of installed modules
// Define the modules installed in the clock by removing the // before the #define
//--------------------------------------------
//#define ONEWIREKEYPAD3x1       // Use a 3x1 keypad with one wire
//#define ONEWIREKEYPAD3x4       // Use a 3x4 keypad with one wire

//------------------------------------------------------------------------------              //
// ESP32 Includes defines and initialisations
//-------------------------------------------
                      #if ESP_ARDUINO_VERSION >= ESP_ARDUINO_VERSION_VAL (3, 2, 0)            // Use EdSoftLED with ESP32 compiler.
#define USEEDSOFTLED
                      #endif
                      #ifdef USEEDSOFTLED
#include <EdSoftLED.h>         // https://github.com/ednieuw/EdSoftLED for LED strip WS2812 or SK6812 
                      #else
#include <Adafruit_NeoPixel.h> // https://github.com/adafruit/Adafruit_NeoPixel  *** USE GPIO NUMBERING and compile By GPIO number (legacy) 
                      #endif
#include <Preferences.h>
#include <NimBLEDevice.h>      // For BLE communication. !!!Use NimBLE version 2.x.x  https://github.com/h2zero/NimBLE-Arduino
#include <WiFi.h>              // Used for web page 
#include <WebServer.h>         // Used for web page 
#include "esp_sntp.h"          // for NTP
#include "esp_wps.h"           // For WPS
#include <Update.h>            // For Over-the-Air (OTA)
#include <ESPmDNS.h>           // To show BLEname in router
#include <DNSServer.h>         // For the web page to enter SSID and password of the WIFI router 
#include <Wire.h>              // Ter zijner tijd Wire functies gaan gebruiken. Staan al klaar in de code 
#include <RTClib.h>            // Used for connected DS3231 RTC // Reference https://adafruit.github.io/RTClib/html/class_r_t_c___d_s3231.html
#include <Encoder.h>           // For rotary encoder
#include <Keypad.h>            // For 3x1 membrane keypad instead of rotary encoder by Mark Stanley & Alexander Brevig 

//------------------------------------------------------------------------------              //
// ARDUINO Definition of installed language word clock
//------------------------------------------------------------------------------
                     #ifdef FOURLANGUAGECLOCK
#define NL
#define UK
#define DE
#define FR    
                     #endif //FOURLANGUAGECLOCK
                     #if defined NLM1M2M3M4L94 ||defined NLM1M2M3M4L114 || (defined NLM1M2M3M4L256) || (defined NLM1M2M3M4L144) || (defined NLM1M2M3M4L161)
#define NLM1M2M3M4
                     #endif

                     #ifdef NL144CLOCK
const uint32_t NUM_LEDS  =  144+4;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  12;                                       // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                       // Grid size For digital display mode.
// const uint32_t NUM_LEDS  =  256;                                   // Temporary for testinf with 16x16LED WS2812. To clear all LEDs. During uploading LEDs get randomly On and Off
// const byte MATRIX_WIDTH  =  16;                                    // Grid size For digital display mode.
// const byte MATRIX_HEIGHT =  16;                                    // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor);   
#define IS      ColorLeds("is",      4,   5, SECColor);  ColorLeds("", 8,10, 0); Is = true;   // Turn off the WAS LEDs
#define WAS     ColorLeds("was",     8,  10, SECColor);  ColorLeds("", 4, 5, 0); Is = false;  // Turn off the IS LEDs
#define PRECIES ColorLeds("precies", 17, 23, LetterColor);
#define MTIEN   ColorLeds("tien",    12, 15, LetterColor); 
#define MVIJF   ColorLeds("vijf",    25, 28, LetterColor); 
#define KWART   ColorLeds("kwart",   30, 34, LetterColor);
#define VOOR    ColorLeds("voor",    44, 47, LetterColor);
#define OVER    ColorLeds("over",    38, 41, LetterColor);
#define HALF    ColorLeds("half",    48, 51, LetterColor);
#define MIDDER  ColorLeds("midder",  53, 58, LetterColor);
#define VIJF    ColorLeds("vijf",    66, 69, LetterColor);
#define TWEE    ColorLeds("twee",    60, 63, LetterColor);
#define EEN     ColorLeds("een",     72, 74, LetterColor);
#define VIER    ColorLeds("vier",    77, 80, LetterColor);
#define TIEN    ColorLeds("tien",    91, 94, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84, 89, LetterColor);
#define DRIE    ColorLeds("drie",    96, 99, LetterColor);
#define NEGEN   ColorLeds("negen",  102,106, LetterColor);
#define ACHT    ColorLeds("acht",   114,117, LetterColor);
#define NACHT   ColorLeds("nacht",  114,118, LetterColor);
#define ZES     ColorLeds("zes",    110,112, LetterColor);
#define ZEVEN   ColorLeds("zeven",  121,125, LetterColor);
#define ELF     ColorLeds("elf",    128,130, LetterColor);
#define NOEN    ColorLeds("noen",   139,142, LetterColor);
#define UUR     ColorLeds("uur",    134,136, LetterColor);
#define EDSOFT  ColorLeds("EdSoft", 148,148, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                    // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
                     #endif //NL144CLOCK
                     #ifdef NL92CLOCK
const uint32_t NUM_LEDS  =  92;                                                               // How many leds in  strip?
const byte MATRIX_WIDTH  =  10;                                                               // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  10;                                                               // Grid size For digital display mode.

#define HET     ColorLeds("Het",     0,   2, MINColor); 
#define IS      ColorLeds("is",      3,   4, SECColor);  ColorLeds("", 5, 7, 0); Is = true;   // Turn off the WAS LEDs
#define WAS     ColorLeds("was",     5,   7, SECColor);  ColorLeds("", 3, 4, 0); Is = false;  // Turn off the IS LEDs
#define MVIJF   ColorLeds("vijf",    12, 15, LetterColor); 
#define MTIEN   ColorLeds("tien",    8,  11, LetterColor);
#define KWART   ColorLeds("kwart",   16, 20, LetterColor);
#define VOOR    ColorLeds("voor",    21, 24, LetterColor);
#define OVER    ColorLeds("over",    32, 35, LetterColor);
#define PRECIES ColorLeds("precies", 25, 31, LetterColor);
#define HALF    ColorLeds("half",    36, 39, LetterColor);
#define ELF     ColorLeds("elf",     40, 42, LetterColor);
#define VIJF    ColorLeds("vijf",    47, 50, LetterColor);
#define TWEE    ColorLeds("twee",    43, 46, LetterColor);
#define EEN     ColorLeds("een",     51, 53, LetterColor);
#define VIER    ColorLeds("vier",    54, 57, LetterColor);
#define TIEN    ColorLeds("tien",    64, 67, LetterColor);
#define TWAALF  ColorLeds("twaalf",  58, 63, LetterColor);
#define DRIE    ColorLeds("drie",    68, 71, LetterColor);
#define NEGEN   ColorLeds("negen",   72, 76, LetterColor);
#define ACHT    ColorLeds("acht",    80, 83, LetterColor);
#define ZES     ColorLeds("zes",     77, 79, LetterColor);
#define ZEVEN   ColorLeds("zeven",   84, 88, LetterColor);
#define UUR     ColorLeds("uur",     89,91, LetterColor);
#define EDSOFT  ColorLeds("EdSoft",  92,92, LetterColor);
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
#define MIN1    ColorLeds("M1",     144,144, LetterColor); 
#define MIN2    ColorLeds("M2",     145,145, LetterColor);                                    // MINColor); 
#define MIN3    ColorLeds("M3",     146,146, LetterColor);
#define MIN4    ColorLeds("M4",     147,147, LetterColor);  
#define X_OFF   ColorLeds("",         0,  2, 0);
#define X_ON    ColorLeds("",         0,  2, LetterColor);
                     #endif //NL92CLOCK

                     #ifdef DE144CLOCK
const uint32_t NUM_LEDS  =  144;                                                              // How many leds in  strip? 
const byte MATRIX_WIDTH  =  12;                                                               // Grid size For digital display mode.  
const byte MATRIX_HEIGHT =  12;                                                               // Grid size For digital display mode.
#define ES      ColorLeds("Es",       1,   2, LetterColor);   
#define IST     ColorLeds("ist",      4,   6, LetterColor);  ColorLeds("", 8, 10, 0); Is = true;
#define WAR     ColorLeds("war",      8,  10, LetterColor);  ColorLeds("", 4,  6, 0); Is = false;
#define GENAU   ColorLeds("genau",   18,  22, LetterColor);
#define MZEHN   ColorLeds("zehn",    13,  16, LetterColor);
#define MFUNF   ColorLeds("funf",   383, 386, LetterColor);
#define VIERTEL ColorLeds("viertel",375, 381, LetterColor);
#define ZWANZIG ColorLeds("zwanzig",413, 419, LetterColor);
#define KURZ    ColorLeds("kurz",   421, 424, LetterColor);
#define VOR     ColorLeds("vor",    433, 435, LetterColor);
#define NACH    ColorLeds("nach",   427, 430, LetterColor);
#define HALB    ColorLeds("halb",   465, 468, LetterColor);
#define FUNF    ColorLeds("funf",   471, 474, LetterColor);
#define EINS    ColorLeds("eins",   483, 486, LetterColor);
#define VIERDE  ColorLeds("vier",   478, 481, LetterColor);
#define ZEHN    ColorLeds("zehn",   514, 517, LetterColor);
#define ZWOLF   ColorLeds("zwolf",  520, 524, LetterColor);
#define DREI    ColorLeds("drei",   532, 535, LetterColor);
#define NEUN    ColorLeds("neun",   526, 529, LetterColor);
#define ACHTDE  ColorLeds("acht",   565, 568, LetterColor);
#define SECHS   ColorLeds("sechs",  570, 574, LetterColor);
#define SIEBEN  ColorLeds("sieben", 580, 585, LetterColor);
#define ZWEI    ColorLeds("zwei",   575, 578, LetterColor);
#define ELFDE   ColorLeds("elf",    614, 616, LetterColor);
#define UHR     ColorLeds("uhr",    621, 623, LetterColor);
                     #endif //DE144CLOCK
                     #ifdef NLM1M2M3M4L94
const uint32_t NUM_LEDS  =  94;                                    // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  10;                                    // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                    // NA Not used in this clock. 10 is fine 
                   
#define HET     ColorLeds("Het",      0,   2, MINColor);           // Special adapted clock face versie Kris. IS and WAS are equal. There is no WAS
#define IS      ColorLeds("is",       3,   4, SECColor);     Is = true;    //ColorLeds("", 3, 4, 0); 
#define WAS     ColorLeds("was",      3,   4, SECColor);     Is = false;  // ColorLeds("", 3, 4, 0); 
#define MVIJF   ColorLeds("vijf",     5,   8, LetterColor); 
#define MVOOR   ColorLeds("voor",     9,  12, LetterColor);
#define MTIEN   ColorLeds("tien",    13,  16, LetterColor); 
#define OVER    ColorLeds("over",    17,  20, LetterColor);
#define KWART   ColorLeds("kwart",   21,  25, LetterColor);
#define OVER2   ColorLeds("over",    26,  29, LetterColor);
#define HALF    ColorLeds("half",    30,  33, LetterColor);
#define VOOR    ColorLeds("voor",    34,  37, LetterColor);
#define EEN     ColorLeds("een",     38,  40, LetterColor);
#define DRIE    ColorLeds("drie",    41,  44, LetterColor);
#define TWEE    ColorLeds("twee",    45,  48, LetterColor);
#define VIER    ColorLeds("vier",    49,  52, LetterColor);
#define VIJF    ColorLeds("vijf",    53,  56, LetterColor);
#define ZES     ColorLeds("zes",     57,  59, LetterColor);
#define NEGEN   ColorLeds("negen",   60,  64, LetterColor);
#define ZEVEN   ColorLeds("zeven",   65,  69, LetterColor);
#define ACHT    ColorLeds("acht",    70,  73, LetterColor);
#define TIEN    ColorLeds("tien",    74,  77, LetterColor);
#define ELF     ColorLeds("elf",     78,  80, LetterColor);
#define TWAALF  ColorLeds("twaalf",  84,  89, LetterColor);
#define UUR     ColorLeds("uur",     81,  83, LetterColor);
#define MIN1    ColorLeds("M1",      90,  90, LetterColor); 
#define MIN2    ColorLeds("M2",      91,  91, LetterColor);       //MINColor); 
#define MIN3    ColorLeds("M3",      92,  92, LetterColor);
#define MIN4    ColorLeds("M4",      93,  93, LetterColor);  
#define EDSOFT  ColorLeds("EdSoft",  94,  94, LetterColor);  
                     #endif //NLM1M2M3M4L94
                     #ifdef NLM1M2M3M4L114 
const uint32_t NUM_LEDS  =  114;                                                              // How many leds in  strip? + 4 for the minutes
const byte MATRIX_WIDTH  =  11;                                                               // NA Not used in this clock. 10 is fine 
const byte MATRIX_HEIGHT =  10;                                                               // NA Not used in this clock. 10 is fine 
                   
