ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV116/ESP32_WordClockV116.ino
    case 'R':                                                                                 // Reset to default settings
      if(InputString.equals("RRRRR"))                                                         // Delete WIFI settings and set defaults
      {
        Reset();
        ResetCredentials();
        ESP.restart();
        break;
      }
      if(InputString.equals("RRR"))                                                           // Delete WIFI settings only
       { 
        ResetCredentials();
        sprintf(sptext, "\nSSID and password deleted. \nWIFI, NTP and BLE is On\n Enter @ to restart");
        break;
       }
      if(len == 1)                                                                            // Set to default settings
        {
        Reset();
        sprintf(sptext, "\nReset to default values: Done");
        lastminute = 99;                                                                      // Force a minute update
        Displaytime();
       } 
      else sprintf(sptext, "**** Length fault R. ****");
      break;
      
    case 'S':                                                                                 // Slope factor for brightness
      validLength = (len > 1 && len < 5);
      if(validLength) 
       {
        Mem.LightReducer = (byte)SConstrainInt(InputString, 1, 1, 255);
        sprintf(sptext, "Slope brightness changed to: %d%%", Mem.LightReducer);
       } 
      else sprintf(sptext, "**** Input fault. \nEnter Snnn where n between 1 and 255");
      break;
      
    case 'T':                                                                                 // Time setting
      if(len == 7) 
       {
        timeinfo.tm_hour = (int)SConstrainInt(InputString, 1, 3, 0, 23);
        timeinfo.tm_min = (int)SConstrainInt(InputString, 3, 5, 0, 59);
        timeinfo.tm_sec = (int)SConstrainInt(InputString, 5, 7, 0, 59);
        if(DS3231Installed) 
         {
          sprintf(sptext, "Time set in external RTC module");
          SetDS3231Time();
          PrintDS3231Time();
         } 
        else sprintf(sptext, "No external RTC module detected");
       } 
      else sprintf(sptext, "**** Length fault. Enter Thhmmss ****");
      break;
      
    case 'U':                                                                                 // Demo mode
      if(len == 1) 
      { 
        if(Demo)  {   lastminute = 99;  Demo = false; }                                       // Force a minute update and turn off demo mode
        else { MilliSecondValue = 200;  Demo = true;  }                                       // If Demomode was off turn it on with 200 msec delay 
        sprintf(sptext, "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);    
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Demo = true;
        sprintf(sptext, "Demo mode: %s, %d msec/min", Demo ? "ON" : "OFF", MilliSecondValue);
       } 
      else sprintf(sptext, "**** Length fault U. Demo mode (Unnn or U) ****");
      break;
      
    case 'W':                                                                                 // WIFI toggle
      if(len == 1) 
       {
        Mem.WIFIOn = 1 - Mem.WIFIOn;
        Mem.NTPOn = Mem.WIFIOn;                                                               // If WIFI is off turn NTP also off
        sprintf(sptext, "WIFI is %s after restart", Mem.WIFIOn ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter W ****");
      break;
      
    case 'X':                                                                                 // NTP toggle
      if(len == 1) 
       {
        Mem.NTPOn = 1 - Mem.NTPOn;
        sprintf(sptext, "NTP is %s after restart", Mem.NTPOn ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter X ****");
      break;
      
    case 'Y':                                                                                 // Play lights
      Play_Lights();
      lastminute = 99;                                                                        // Force a minute update
      sprintf(sptext, "**** Play Lights");
      break;
      
    case 'Z':                                                                                 // Start WPS
      sprintf(sptext, "**** Start WPS on your router");
      WiFi.onEvent(WiFiEvent);
      WiFi.mode(WIFI_STA);
      Serial.println("Starting WPS");
      wpsInitConfig();
      wpsStart();
      break;
      
    case '!':                                                                                 // Print times
      if(len == 1) PrintAllClockTimes();
      sprintf(sptext,"\n");
      break;
      
    case '@':                                                                                 // Reset ESP
      if(len == 1) 
       {
        Tekstprintln("\n*********\n ESP restarting\n*********\n");
        ESP.restart();
       } 
      else sprintf(sptext, "**** Length fault. Enter @ ****");
      break;
      
    case '#':                                                                                 // Self test
      if(len == 1) 
       {
        Zelftest = 1 - Zelftest;
        sprintf(sptext, "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest();
        Displaytime();
       } 
      else if(len > 1 && len < 6) 
       {
        MilliSecondValue = InputString.substring(1, 5).toInt();
        Zelftest = 1 - Zelftest;
        sprintf(sptext, "Zelftest: %s", Zelftest ? "ON" : "OFF");
        Selftest(MilliSecondValue);
        Displaytime();
       } 
      else sprintf(sptext, "**** Length fault #. Demo mode (#nnnn or #) ****");
      break;
      
    case '$':                                                                                 // Fire display
      FireDisplay = 1 - FireDisplay;
      sprintf(sptext, "FireDisplay: %s", FireDisplay ? "On" : "Off");
      ClearScreen();
      Displaytime();
      break;
      
    case '%':                                                                                 // LED strip type
      if(len == 1) 
       {
        Mem.LEDstrip = 1 - Mem.LEDstrip;
        sprintf(sptext, "LED strip is %s after restart", Mem.LEDstrip ? "WS2812" : "SK6812");
       } 
      else sprintf(sptext, "**** Length fault . ****");
      break;

     case '^':                                                                                 // NOP
      if(len == 1) 
       {
        sprintf(sptext, "--- %s ---", Mem.ByteFuture4 ? "OFF" : "ON");
       } 
      else sprintf(sptext, "**** Length fault . ****");
      break;

    case '&':                                                                                 // Force NTP update
      if(len == 1) 
       {
        SetDS3231Time();
        SetRTCTime();
        PrintAllClockTimes();
        sprintf(sptext,"\n");
       } 
      else sprintf(sptext, "**** Length fault &. ****");
      break;
      
    case '(':  
      Mem.EdSoftLEDSOn = 1 - Mem.EdSoftLEDSOn;
      sprintf(sptext, "EDSOFT is %s", Mem.EdSoftLEDSOn ? "ON" : "OFF");
      break;
    case ')':
      Mem.HetIsWasOff = 1 - Mem.HetIsWasOff;
      sprintf(sptext, "HET IS WAS is %s", Mem.HetIsWasOff ? "OFF" : "ON");
      break;

    case '~':
      if(len == 1) 
       {
        if (Mem.RandomDisplay > 0) Mem.RandomDisplay = 0;
        else                       Mem.RandomDisplay = 1;
       }
      if(len == 2) 
       {
        byte ff = (byte)InputString.substring(1, 2).toInt();
        if (ff < 3) Mem.RandomDisplay = ff;
       }
      Mem.DisplayChoice = DEFAULTCOLOUR;
      sprintf(sptext, "Random display is %s", Mem.RandomDisplay==1 ? "ON/min" : Mem.RandomDisplay==2 ? "ON/hour" : "OFF");
      break;

    case '+':                                                                                 // BLE string toggle
      if(len == 1) 
       {
        Mem.UseBLELongString = 1 - Mem.UseBLELongString;
        sprintf(sptext, "Fast BLE is %s", Mem.UseBLELongString ? "ON" : "OFF");
       } 
      else sprintf(sptext, "**** Length fault. Enter + ****");
      break;
      
